{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 392], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 392], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "ZeroPadding", "config": {"trainable": true, "name": "zero_padding_3"}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "zero_padding_3"}, {"class_name": "ZeroPadding", "config": {"trainable": true, "name": "zero_padding_4"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "zero_padding_4"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 392], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 392], "name": "input_4", "sparse": false}, "name": "input_4"}, {"class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "use_bias": true, "activity_regularizer": null}, "name": "dense_5"}, {"class_name": "Dense", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "use_bias": true, "activity_regularizer": null}, "name": "dense_6"}, {"class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "hid_l1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "name": "hid_l1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "hid_r1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "name": "hid_r1"}, {"class_name": "Dense", "inbound_nodes": [[["hid_l1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "hid_l", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null}, "name": "hid_l"}, {"class_name": "Dense", "inbound_nodes": [[["hid_r1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "hid_r", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null}, "name": "hid_r"}, {"class_name": "Merge", "inbound_nodes": [[["hid_l", 0, 0, {}], ["hid_r", 0, 0, {}]]], "config": {"name": "merge_2", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "mode": "sum"}, "name": "merge_2"}, {"class_name": "Dense", "inbound_nodes": [[["merge_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 392, "use_bias": true, "activity_regularizer": null}, "name": "dense_7"}, {"class_name": "Dense", "inbound_nodes": [[["merge_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 392, "use_bias": true, "activity_regularizer": null}, "name": "dense_8"}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "name": "model_3", "output_layers": [["dense_7", 0, 0], ["dense_8", 0, 0], ["merge_2", 0, 0]]}, "inbound_nodes": [[["input_3", 0, 0, {}], ["zero_padding_3", 0, 0, {}]], [["zero_padding_4", 0, 0, {}], ["input_4", 0, 0, {}]]], "name": "model_3"}, {"class_name": "CorrnetCost", "config": {"lamda": -0.02, "trainable": true, "name": "corrnet_cost_2"}, "inbound_nodes": [[["model_3", 1, 2, {}], ["model_3", 2, 2, {}]]], "name": "corrnet_cost_2"}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["model_3", 1, 1], ["model_3", 2, 0], ["model_3", 1, 0], ["model_3", 2, 1], ["corrnet_cost_2", 0, 0]], "name": "model_4"}, "backend": "theano"}